example/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
-0.5477233720356959
-0.5477246682655305
-0.5477257817785329
-0.5477189671753259
-0.5477223458636306
-0.5477205793959388
-0.5477261619127423
-0.5477209400471486
...
);

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {   
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}
                                        

// ************************************************************************* //
