example/0/Temp
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Temp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
      type cyclic;
    }

  right
    {
      type cyclic;
    }

  top
    {
      type cyclic;
    }

  bottom
    {
      type cyclic;
    }

  // symmetric
  //   {
  //     type zeroGradient;
  //   }
  
  defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
