example/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

  left
    {
      type cyclic;
    }

  right
    {
      type cyclic;
    }

  top
    {
      type cyclic;
    }

  bottom
    {
      type cyclic;
    }
  
  // symmetric
  //   {
  //   	type		zeroGradient;
  //   }
    
  defaultFaces
    {
        type            empty;
    }
                       
}

// ************************************************************************* //
