example/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh   dynamicRefineFvMesh;
// dynamicFvMesh   dynamicRefine2DFvMesh;

dynamicFvMesh   staticFvMesh;

dynamicRefine2DFvMeshCoeffs{

  nBufferLayersR 2;

  // How often to refine
  refineInterval  1;

  // Field to be refinement on
  field           Qxx;

  // Refine field inbetween lower..upper
  lowerRefineLevel 0.001;
  upperRefineLevel 0.999;

  // If value < unrefineLevel unrefine
  unrefineLevel   10;

  // Have slower than 2:1 refinement
  nBufferLayers   1;

  // Refine cells only up to maxRefinement levels
  maxRefinement   2;

  // Stop refinement if maxCells reached
  maxCells        30000;

  // Flux field and corresponding velocity field. Fluxes on changed
  // faces get recalculated by interpolating the velocity. Use 'none'
  // on surfaceScalarFields that do not need to be reinterpolated.
  correctFluxes
    (
     (phi none)
     // (rhoPhi none)    
     );

  // Write the refinement level as a volScalarField
  dumpLevel       true;
};

// ************************************************************************* //
