example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// convertToMeters 0.0025;
convertToMeters 10;

vertices
(
    ( -0.5 -0.015625 -0.5)
    (  0.5 -0.015625 -0.5)
    (  0.5  0.015625 -0.5)
    ( -0.5  0.015625 -0.5)
    ( -0.5 -0.015625  0.5)
    (  0.5 -0.015625  0.5)
    (  0.5  0.015625  0.5)
    ( -0.5  0.015625  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 1 128) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
 
 left
 {
   type cyclic;
   neighbourPatch right;
   faces
     (
      (0 4 7 3)
      );
 }

 right
 {
   type cyclic;
   neighbourPatch left;
   faces
     (
      (1 5 6 2)
      );
 }

 bottom
 {
   type cyclic;
   neighbourPatch top;
   faces
     (
      (0 1 2 3)
      );
 }

 top
 {
   type cyclic;
   neighbourPatch bottom;
   faces
     (
      (4 5 6 7)
      );
 }
 
 // symmetric
 // {
 //   type wall;
 //   faces
 //     (
 //      (0 1 2 3)
 //      (0 3 7 4)
 //      (1 2 6 5)
 //      (4 5 6 7)
 //      );
 // }
 
 );

mergePatchPairs
(
);

// ************************************************************************* //
