example/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver           GAMG;
      smoother         DICGaussSeidel;	
      tolerance        1e-7;
      relTol           0.001;

      // minIter         3;              // a minimum number of iterations
      // maxIter         100;            // limitation of iterions number
      // smoother        DIC;            // setting for GAMG
      // nPreSweeps      1;              // 1 for pd, set to 0 for all other!
      // nPostSweeps     2;              // 2 is fine
      // nFinestSweeps   2;              // 2 is fine
      // scaleCorrection true;           // true is fine
      // directSolveCoarsestLevel false; // false is fine
      // cacheAgglomeration on;          // on is fine; set to off, if dynamic
      // // mesh refinement is used!
      // nCellsInCoarsestLevel 500;      // 500 is fine,
      // // otherwise sqrt(number of cells)
      // agglomerator    faceAreaPair;   // faceAreaPair is fine
      // mergeLevels     1;              // 1 is fine
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
      solver          smoothSolver;
      smoother        symGaussSeidel;
      tolerance       1e-06;
      relTol          0.001;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    Psi
    {
	solver 		PBiCGStab;
	preconditioner 	DILU;
	tolerance 	1e-6;
	relTol		0.001;
    }

    PsiFinal
    {
	$Psi;
	relTol 0;
    }

    lapPsi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.001;
    }

    lapPsiFinal
    {
        $lapPsi;
        relTol 0;
    }

    Qxx
      {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.001;
    }

    Qxy
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.001;
    }

    QxxFinal
      {
	$Qxx;
	relTol 0;
      }

    QxyFinal
      {
	$Qxy;
	relTol 0;
      }
}

PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    pRefCell 1;
    pRefValue    0;
}

// ************************************************************************* 
